Constraints defined by highlighted Lines and Dimensions can't be satisfied.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId VarSketchFailure { get; }
  Visual Basic
Public Shared ReadOnly Property VarSketchFailure As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ VarSketchFailure {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace